nxp-mcuxpresso/mcux-soc-svd/MCXN546/MCXN546_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>USBHS1__USBC</name>
      <description>USB</description>
      <groupName>USBC</groupName>
      <baseAddress>0x4010B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1E0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USB1_HS</name>
        <value>67</value>
      </interrupt>
      <registers>
        <register>
          <name>ID</name>
          <description>Identification</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xE4A1FA05</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID</name>
              <description>Configuration Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NID</name>
              <description>Complement Version of ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>Revision Number of the Controller Core</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWGENERAL</name>
          <description>Hardware General</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x15</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PHYW</name>
              <description>Data width of the transceiver connected to the controller core</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_BUS_8</name>
                  <description>8 bit wide data bus (Software non-programmable)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_BUS_16</name>
                  <description>16 bit wide data bus (Software non-programmable)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_RST_8</name>
                  <description>Reset to 8 bit wide data bus (Software programmable)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_RST_16</name>
                  <description>Reset to 16 bit wide data bus (Software programmable)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYM</name>
              <description>Transceiver Type</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UTMI</name>
                  <description>UTMI/UMTI+</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULPI_DDR</name>
                  <description>ULPI DDR</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULPI</name>
                  <description>ULPI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL</name>
                  <description>Serial Only</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_RST_UTMI</name>
                  <description>Software programmable - reset to UTMI/UTMI+</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_RST_ULPI_DDR</name>
                  <description>Software programmable - reset to ULPI DDR</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_RST_ULPI</name>
                  <description>Software programmable - reset to ULPI</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_RST_SERIAL</name>
                  <description>Software programmable - reset to Serial</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM</name>
              <description>Serial interface mode capability</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SERIAL_ENGINE_NO</name>
                  <description>No Serial Engine, always use parallel signalling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL_ENGINE_EN</name>
                  <description>Serial Engine present, always use serial signalling for FS/LS</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_RST_PARALLEL</name>
                  <description>Software programmable - Reset to use parallel signalling for FS/LS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_RST_SERIAL_ENG</name>
                  <description>Software programmable - Reset to use serial signalling for FS/LS</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HWHOST</name>
          <description>Host Hardware Parameters</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x10020001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HC</name>
              <description>Host Capable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HOST_OP_DIS</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOST_OP_EN</name>
                  <description>Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPORT</name>
              <description>The Number of downstream ports supported by the host controller is (NPORT+1)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWDEVICE</name>
          <description>Device Hardware Parameters</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x11</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DC</name>
              <description>Device Capable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEVICE_OP_DIS</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEVICE_OP_EN</name>
                  <description>Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEVEP</name>
              <description>Device Endpoint Number</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWTXBUF</name>
          <description>TX Buffer Hardware Parameters</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x80050808</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXBURST</name>
              <description>Default burst size for memory to TX buffer transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXCHANADD</name>
              <description>TX FIFO Buffer size is: (2^TXCHANADD) * 4 Bytes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWRXBUF</name>
          <description>RX Buffer Hardware Parameters</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x808</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXBURST</name>
              <description>Default burst size for memory to RX buffer transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXADD</name>
              <description>Buffer total size for all receive endpoints is (2^RXADD)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTIMER0LD</name>
          <description>General Purpose Timer #0 Load</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPTLD</name>
              <description>General Purpose Timer Load Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTIMER0CTRL</name>
          <description>General Purpose Timer #0 Controller</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPTCNT</name>
              <description>General Purpose Timer Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPTMODE</name>
              <description>General Purpose Timer Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE_SHOT</name>
                  <description>One Shot Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEAT</name>
                  <description>Repeat Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPTRST</name>
              <description>General Purpose Timer Reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION</name>
                  <description>No action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD_CNTR</name>
                  <description>Load counter value from GPTLD bits in n_GPTIMER0LD</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPTRUN</name>
              <description>General Purpose Timer Run</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_CNTR</name>
                  <description>Stop counting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Run</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTIMER1LD</name>
          <description>General Purpose Timer #1 Load</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPTLD</name>
              <description>General Purpose Timer Load Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTIMER1CTRL</name>
          <description>General Purpose Timer #1 Controller</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPTCNT</name>
              <description>General Purpose Timer Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPTMODE</name>
              <description>General Purpose Timer Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE_SHOT</name>
                  <description>One Shot Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEAT</name>
                  <description>Repeat Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPTRST</name>
              <description>General Purpose Timer Reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION</name>
                  <description>No action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD_CNTR</name>
                  <description>Load counter value from GPTLD bits in USB_n_GPTIMER0LD</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPTRUN</name>
              <description>General Purpose Timer Run</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_CNTR</name>
                  <description>Stop counting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Run</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SBUSCFG</name>
          <description>System Bus Config</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AHBBRST</name>
              <description>AHB master interface Burst configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCR_BURST</name>
                  <description>Incremental burst of unspecified length only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4_BURST</name>
                  <description>INCR4 burst, then single transfer</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8_BURST</name>
                  <description>INCR8 burst, INCR4 burst, then single transfer</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16_BURST</name>
                  <description>INCR16 burst, INCR8 burst, INCR4 burst, then single transfer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4_UNSPEC</name>
                  <description>INCR4 burst, then incremental burst of unspecified length</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8_4_UNSPEC</name>
                  <description>INCR8 burst, INCR4 burst, then incremental burst of unspecified length</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16_8_4_UNSPEC</name>
                  <description>INCR16 burst, INCR8 burst, INCR4 burst, then incremental burst of unspecified length</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPLENGTH</name>
          <description>Capability Registers Length</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x40</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CAPLENGTH</name>
              <description>These bits are used as an offset to add to register base to find the beginning of the Operational Register. Default value is '40h'.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCIVERSION</name>
          <description>Host Controller Interface Version</description>
          <addressOffset>0x102</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>HCIVERSION</name>
              <description>Host Controller Interface Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
